УТ_для_edt.РасширениеСмарт/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартНеПроверятьРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартОтветсвтенныйЗаРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4aa81cd-18f1-4902-9c1f-c902893806b3">
    <name>смартГенеральныйДиректор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="766ca5a6-8585-4744-82ef-ceeb65521cb2">
    <name>смартБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47683048-9c72-4bdd-96b5-bc2b6dcad26a">
    <name>смартОтветственныйЗаЭДО</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cfd754c-c822-4e79-b5ab-2ee7ff24fb99">
    <name>смартСтатусКонтактныхДанныхКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94a7affe-e81a-4e16-9597-b677a73ec63f">
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d433a349-afcf-447e-ae95-310605a8cb7a">
    <name>смартНеОбновлятьКППВноситБухгалтерия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияКонтрагентов/СостоянияКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/СостоянияСуществованияКонтрагента/СостоянияСуществованияКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияСуществованияКонтрагента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>КонтрагентЕстьВБазеФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КонтрагентНеПодлежитПроверке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеДействуетИлиИзмененКПП</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПустойИННИлиКПП</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="02c342c8-4238-4cef-94d6-c869e4283540">
  <name>ЮридическоеФизическоеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="cd40689d-5647-4119-af23-963f3a2190c6">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84450f4c-12f4-48e1-92d7-52e1fec0d1f1">
    <name>смартМенеджерСайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a4348b-43e7-46fb-966f-fdf2e9858abd">
    <name>смартРабочаяПочта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9984e2d4-a5d7-4891-bd52-251aae7eea37">
    <name>смартРабочийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Контрагенты/ObjectModule.bsl
#Область ПеренесеноСДоработками

//++ смарт:ММ #060 319 03.08.2020 - доработка спр. Конрагенты
&После("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ)
	
	//++ смарт:ММ #081 396 08.11.2020 - Проверка при записи спр. Контрагенты
	Если Не ЭтотОбъект.смартНеОбновлятьКППВноситБухгалтерия Тогда
		смартПроверитьИННЮрЛица(Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	//-- смарт:ММ 08.11.2020

	Если Ссылка.смартСтатусКонтактныхДанныхКонтрагента <> смартСтатусКонтактныхДанныхКонтрагента Тогда
		Если смартСтатусКонтактныхДанныхКонтрагента = Перечисления.смартСтатусыКонтактныхДанныхКонтрагентов.ОтсутствуютИлиНеактуальны
			ИЛИ смартСтатусКонтактныхДанныхКонтрагента = Перечисления.смартСтатусыКонтактныхДанныхКонтрагентов.НеУдалосьСвязатьсяСКонтрагентом
			Тогда
			
			ДополнительныеСвойства.Вставить("смартОтпарвлятьУведомлениеОСтатусеКонтактныхДанных", Истина);
			
		КонецЕсли;
	КонецЕсли;
	
	//++ #4802 смарт: Тимофеева 09.12.2025 / Не фиксируются изменения в юридическом адресе Контрагента при заполнении данных по кнопке, по данным ЕГРЮЛ.
	//ИСКЛЮЧЕНИЯ для контрагента с ИНН 9109004874: нет адреса "298033, Республика Крым, г Судак, с Морское, ул Калинина, дом 67"
	Если ЭтотОбъект.ИНН	= "9109004874" Тогда
		Отбор = Новый Структура("Вид, ДействуетС, Представление", 
									Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,
									Дата("30.11.2015 0:00:00"),
									"298033, Республика Крым, г Судак, с Морское, ул Калинина, дом 67");
		НайденныеСтроки = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЭтотОбъект.КонтактнаяИнформация.Удалить(НайденныеСтроки[0]);		
		КонецЕсли;
	КонецЕсли;
	//#4802 смарт: Тимофеева 09.12.2025
КонецПроцедуры //-- смарт:ММ 03.08.2020

//++ смарт:ММ #060 319 04.08.2020 - доработка спр. Конрагенты
&После("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("смартОтпарвлятьУведомлениеОСтатусеКонтактныхДанных")
		И ДополнительныеСвойства.смартОтпарвлятьУведомлениеОСтатусеКонтактныхДанных = Истина Тогда
		смартОтправитьУведомлениеОСтатусеКонтактныхДанных();
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 04.08.2020

&После("ПриКопировании")
Процедура смарт_ПриКопированииПосле(ОбъектКопирования)
	
	//++#1459 смарт: Лопато 13.09.2023 //При копировании контрагента не очищается история наименования
	смартОбщегоНазначения.ОчиститьРеквизитыОбъекта(ЭтотОбъект, , , "Партнер");
	//--#1459 смарт: Лопато 13.09.2023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ смарт:ММ #012 152 13.12.2019
Функция смартЗаполнитьФактическийАдресПоЮридическому() Экспорт
	
	БылиИзменения = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	// 15.07.2020
	//ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформация.Страна КАК Страна,
	|	КонтактнаяИнформация.Регион КАК Регион,
	|	КонтактнаяИнформация.Город КАК Город,
	|	КонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	КонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	КонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	КонтактнаяИнформация.ВидДляСписка КАК ВидДляСписка,
	|	КонтактнаяИнформация.ДействуетС КАК ДействуетС,
	|	КонтактнаяИнформация.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_КИ
	|ИЗ
	|	&КонтактнаяИнформация КАК КонтактнаяИнформация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_КИ.ДействуетС) КАК ДействуетС,
	|	ВТ_КИ.Вид КАК Вид,
	|	ВТ_КИ.Тип КАК Тип
	|ПОМЕСТИТЬ ВТ_АктуальнаяДатаЮридическогоАдреса
	|ИЗ
	|	ВТ_КИ КАК ВТ_КИ
	|ГДЕ
	|	ВТ_КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И ВТ_КИ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КИ.Вид,
	|	ВТ_КИ.Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ФактАдрес.Представление КАК Представление
	|ИЗ
	|	ВТ_КИ КАК ФактАдрес
	|ГДЕ
	|	ФактАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И ФактАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
	|	И ФактАдрес.Представление <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЮрАдрес.Представление КАК Представление,
	|	ЮрАдрес.Вид КАК Вид,
	|	ЮрАдрес.Тип КАК Тип,
	|	ЮрАдрес.ЗначенияПолей КАК ЗначенияПолей,
	|	ЮрАдрес.Страна КАК Страна,
	|	ЮрАдрес.Регион КАК Регион,
	|	ЮрАдрес.Город КАК Город,
	|	ЮрАдрес.АдресЭП КАК АдресЭП,
	|	ЮрАдрес.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	ЮрАдрес.НомерТелефона КАК НомерТелефона,
	|	ЮрАдрес.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	ЮрАдрес.ВидДляСписка КАК ВидДляСписка,
	|	ЮрАдрес.ДействуетС КАК ДействуетС,
	|	ЮрАдрес.Значение КАК Значение
	|ИЗ
	|	ВТ_АктуальнаяДатаЮридическогоАдреса КАК ВТ_АктуальнаяДатаЮридическогоАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КИ КАК ЮрАдрес
	|		ПО ВТ_АктуальнаяДатаЮридическогоАдреса.Вид = ЮрАдрес.Вид
	|			И ВТ_АктуальнаяДатаЮридическогоАдреса.Тип = ЮрАдрес.Тип
	|			И ВТ_АктуальнаяДатаЮридическогоАдреса.ДействуетС = ЮрАдрес.ДействуетС
	|ГДЕ
	|	ЮрАдрес.Представление <> """"";
	
	Запрос.УстановитьПараметр("КонтактнаяИнформация", КонтактнаяИнформация.Выгрузить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаФактическийАдрес = РезультатЗапроса[РезультатЗапроса.Количество() - 2].Выбрать();
	
	//++ #3870 смарт: Тимофеева 12.08.2025 / Проверка данных контрагента при проведении реализации
	//разрешено, и главным бухгалтером согласовано, что для ИП фактический адрес может не равняться юридическому

	  //  //++ смарт:ММ #076 373 08.10.2020 - Доработка справочника Контрагенты - факт. адрес 
	  //  // Фактический адрес ВСЕГДА приравнивается к юридическому (кроме обособленных подразделений)
	  //  //Если НЕ ВыборкаФактическийАдрес.Следующий() Тогда
	  //Если (ОбособленноеПодразделение И НЕ ВыборкаФактическийАдрес.Следующий())
	  //	ИЛИ НЕ ОбособленноеПодразделение Тогда
	  //  //-- смарт:ММ 08.10.2020
	  
	Если (ОбособленноеПодразделение И НЕ ВыборкаФактическийАдрес.Следующий())
		  ИЛИ (ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель И НЕ ВыборкаФактическийАдрес.Следующий())
	  	  ИЛИ (НЕ ОбособленноеПодразделение И НЕ ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель) Тогда
  
	//-- #3870 смарт: Тимофеева 12.08.2025
	
		// Фактический адрес не заполнен. Проверка, заполнен ли юридический адрес		
		ВыборкаЮридическийАдрес = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать();
		
		Если ВыборкаЮридическийАдрес.Следующий() Тогда
			
			// Проверка, есть ли строка с фактическим адресом (истина, если строка есть, но она не заполнена)
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
			ПараметрыОтбора.Вставить("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента"));

			НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаФактАдрес = КонтактнаяИнформация.Добавить();
			Иначе 
				СтрокаФактАдрес = НайденныеСтроки[0];
				
				//++ смарт:ММ #076 373 27.10.2020 - Доработка справочника Контрагенты - факт. адрес
				// Сохранение прежнего фактического адреса в новый вид, если юр. адрес не менялся, а просто хочет перезаписаться фактический адрес
				
				ПараметрыОтбораЮрАдрес = Новый Структура;
				ПараметрыОтбораЮрАдрес.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
				ПараметрыОтбораЮрАдрес.Вставить("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента"));
				
				НайденныеСтрокиЮр = Ссылка.КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбораЮрАдрес);
				
				Если НайденныеСтрокиЮр.Количество() > 0 Тогда
					СтрокаЮрАдресВБазе = НайденныеСтрокиЮр[0];
					
					Если СтрокаФактАдрес.Представление <> ВыборкаЮридическийАдрес.Представление // Факт адрес не совпадает с текущим юр. адресом
						И СтрокаЮрАдресВБазе.Представление = ВыборкаЮридическийАдрес.Представление Тогда  // текущий юр. адрес не менялся
						смартСкопироватьФактическийАдрес(СтрокаФактАдрес);
					КонецЕсли;	
				КонецЕсли;
				//-- смарт:ММ 27.10.2020
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаФактАдрес, ВыборкаЮридическийАдрес, , "Вид, ВидДляСписка");
			СтрокаФактАдрес.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			СтрокаФактАдрес.ВидДляСписка = СтрокаФактАдрес.Вид;
			
			БылиИзменения = Истина;
		КонецЕсли;
	КонецЕсли;

	//БылиИзменения = Ложь;
	
	Возврат БылиИзменения;
	
КонецФункции //-- смарт:ММ 13.12.2019

//++ смарт:ММ #076 373 27.10.2020 - Доработка справочника Контрагенты - факт. адрес
Процедура смартСкопироватьФактическийАдрес(СтрокаПрежнийФактическийАдрес)
	
	ВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Факт. адрес (смарт)", Истина);
	
	Если НЕ ЗначениеЗаполнено(ВидКИ) Тогда
		
		ФактАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		
		ВидКИОбъект = ФактАдресКонтрагента.Скопировать();	
		ВидКИОбъект.Наименование = "Факт. адрес (смарт)";
		ВидКИОбъект.Используется = Истина;
		ВидКИОбъект.Записать();
		ВидКИ = ВидКИОбъект.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидКИ) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	ПараметрыОтбора.Вставить("Вид", ВидКИ);
	
	НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаФактАдрес = КонтактнаяИнформация.Добавить();
	Иначе 
		СтрокаФактАдрес = НайденныеСтроки[0];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаФактАдрес, СтрокаПрежнийФактическийАдрес);
	СтрокаФактАдрес.Вид = ВидКИ;
	СтрокаФактАдрес.ВидДляСписка = СтрокаФактАдрес.Вид;
	
КонецПроцедуры //-- смарт:ММ 27.10.2020

//++ смарт:ММ #012 152 14.12.2019
Функция смартЗаполнитьЕmailТелефонИзПартнера(ЗаполнитьEmail = Истина, ЗаполнитьТелефон = Истина) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТелефонЗаполнен", 	Ложь);
	СтруктураВозврата.Вставить("EmailЗаполнен", 	Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформацияПартнера.Представление КАК Представление,
	|	КонтактнаяИнформацияПартнера.Вид КАК Вид,
	|	КонтактнаяИнформацияПартнера.Тип КАК Тип,
	|	КонтактнаяИнформацияПартнера.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформацияПартнера.Страна КАК Страна,
	|	КонтактнаяИнформацияПартнера.Регион КАК Регион,
	|	КонтактнаяИнформацияПартнера.Город КАК Город,
	|	КонтактнаяИнформацияПартнера.АдресЭП КАК АдресЭП,
	|	КонтактнаяИнформацияПартнера.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	КонтактнаяИнформацияПартнера.НомерТелефона КАК НомерТелефона,
	|	КонтактнаяИнформацияПартнера.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	КонтактнаяИнформацияПартнера.ВидДляСписка КАК ВидДляСписка,
	|	КонтактнаяИнформацияПартнера.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_КИ
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК КонтактнаяИнформацияПартнера
	|ГДЕ
	|	КонтактнаяИнформацияПартнера.Ссылка = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Телефон.Представление КАК Представление,
	|	Телефон.Вид КАК Вид,
	|	Телефон.Тип КАК Тип,
	|	Телефон.ЗначенияПолей КАК ЗначенияПолей,
	|	Телефон.Страна КАК Страна,
	|	Телефон.Регион КАК Регион,
	|	Телефон.Город КАК Город,
	|	Телефон.АдресЭП КАК АдресЭП,
	|	Телефон.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	Телефон.НомерТелефона КАК НомерТелефона,
	|	Телефон.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	Телефон.ВидДляСписка КАК ВидДляСписка,
	|	Телефон.Значение КАК Значение
	|ИЗ
	|	ВТ_КИ КАК Телефон
	|ГДЕ
	|	Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера)
	|	И Телефон.Представление <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Email.Представление КАК Представление,
	|	Email.Вид КАК Вид,
	|	Email.Тип КАК Тип,
	|	Email.ЗначенияПолей КАК ЗначенияПолей,
	|	Email.Страна КАК Страна,
	|	Email.Регион КАК Регион,
	|	Email.Город КАК Город,
	|	Email.АдресЭП КАК АдресЭП,
	|	Email.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	Email.НомерТелефона КАК НомерТелефона,
	|	Email.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	Email.ВидДляСписка КАК ВидДляСписка,
	|	Email.Значение КАК Значение
	|ИЗ
	|	ВТ_КИ КАК Email
	|ГДЕ
	|	Email.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И Email.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПартнера)
	|	И Email.Представление <> """"";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Телефон
	
	Если ЗаполнитьТелефон Тогда
		ВыборкаТелефон = РезультатЗапроса[РезультатЗапроса.Количество() - 2].Выбрать();
		
		Если ВыборкаТелефон.Следующий() Тогда
			
			// Проверка, есть ли строка с телефоном у контрагента (истина, если строка есть, но она не заполнена)
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
			ПараметрыОтбора.Вставить("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента"));
			
			НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаТелефон = КонтактнаяИнформация.Добавить();
			Иначе 
				СтрокаТелефон = НайденныеСтроки[0];
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаТелефон, ВыборкаТелефон, , "Вид, ВидДляСписка");
			СтрокаТелефон.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			СтрокаТелефон.ВидДляСписка = СтрокаТелефон.Вид;
			
			СтруктураВозврата.ТелефонЗаполнен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// e-mail
	
	Если ЗаполнитьEmail Тогда
		ВыборкаEmail = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать();
		
		Если ВыборкаEmail.Следующий() Тогда
			
			// Проверка, есть ли строка с e-mail у контрагента (истина, если строка есть, но она не заполнена)
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
			ПараметрыОтбора.Вставить("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailКонтрагента"));
			
			НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаEmail = КонтактнаяИнформация.Добавить();
			Иначе 
				СтрокаEmail = НайденныеСтроки[0];
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаEmail, ВыборкаEmail, , "Вид, ВидДляСписка");
			СтрокаEmail.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
			СтрокаEmail.ВидДляСписка = СтрокаEmail.Вид;
			
			СтруктураВозврата.EmailЗаполнен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции //-- смарт:ММ 14.12.2019

//++ смарт:ММ #012 152 14.12.2019
Функция смартПроверитьЗаполнениеEmailИТелефона(ПроверятьТелефон = Истина, ПроверятьEmail = Истина, ХотяБыОдноЗаполнено = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|	КонтактнаяИнформация.Страна КАК Страна,
	|	КонтактнаяИнформация.Регион КАК Регион,
	|	КонтактнаяИнформация.Город КАК Город,
	|	КонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	КонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|	КонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|	КонтактнаяИнформация.ВидДляСписка КАК ВидДляСписка,
	|	КонтактнаяИнформация.ДействуетС КАК ДействуетС,
	|	КонтактнаяИнформация.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_КИ
	|ИЗ
	|	&КонтактнаяИнформация КАК КонтактнаяИнформация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Телефон.Представление КАК Представление
	|ИЗ
	|	ВТ_КИ КАК Телефон
	|ГДЕ
	|	Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|	И Телефон.Представление <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЭлПочта.Представление КАК Представление
	|ИЗ
	|	ВТ_КИ КАК ЭлПочта
	|ГДЕ
	|	ЭлПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ЭлПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
	|	И ЭлПочта.Представление <> """"
	|;
	|
	//++ #Б2158 смарт: Шляпников 10.03.2025 / Контактная информация у ликвидированных контрагентов
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияКонтрагентов.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостоянияКонтрагентов КАК СостоянияКонтрагентов
	|ГДЕ
	|	СостоянияКонтрагентов.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("КонтактнаяИнформация", КонтактнаяИнформация.Выгрузить());
	Запрос.УстановитьПараметр("Контрагент", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ПропуститьПроверку = Ложь;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Если РезультатЗапроса[РезультатЗапроса.Количество() - 1].Пустой() Тогда
			ПропуститьПроверку = Истина;
		Иначе
			
			Выборка = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать();
			Выборка.Следующий();
			
			Если Выборка.Состояние = Перечисления.СостоянияСуществованияКонтрагента.НеДействуетИлиИзмененКПП
				ИЛИ Выборка.Состояние = Перечисления.СостоянияСуществованияКонтрагента.КонтрагентОтсутствуетВБазеФНС Тогда
				
				ПропуститьПроверку = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	ТелефонЗаполнен = Истина;
	EmailЗаполнен 	= Истина;
	
	Если ПроверятьТелефон И НЕ ПропуститьПроверку Тогда	
		Если РезультатЗапроса[РезультатЗапроса.Количество() - 3].Пустой() Тогда
			ТелефонЗаполнен = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверятьEmail И НЕ ПропуститьПроверку Тогда		
		Если РезультатЗапроса[РезультатЗапроса.Количество() - 2].Пустой() Тогда
			EmailЗаполнен = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверятьТелефон И ПроверятьEmail И НЕ ПропуститьПроверку Тогда
		Если ХотяБыОдноЗаполнено Тогда
			Возврат ТелефонЗаполнен ИЛИ EmailЗаполнен;
		Иначе			
			Возврат ТелефонЗаполнен И EmailЗаполнен;
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверятьТелефон И НЕ ПропуститьПроверку Тогда
		Возврат ТелефонЗаполнен;
	КонецЕсли;
	
	Если ПроверятьEmail И НЕ ПропуститьПроверку Тогда
		Возврат EmailЗаполнен;
	КонецЕсли;
	
	//-- #Б2158 смарт: Шляпников 10.03.2025
	
	Возврат Истина;
	
КонецФункции //-- смарт:ММ 14.12.2019

//++ смарт:ММ #060 319 04.08.2020 - доработка спр. Конрагенты
Процедура смартОтправитьУведомлениеОСтатусеКонтактныхДанных()
	
	МассивАдресовСтрокой = "";
	МассивАдресовДляОтправки = смартПолучитьАдресаПолучателейУведомлений(МассивАдресовСтрокой);
	
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	//// ОТЛАДКА
	//МассивАдресовДляОтправки = Новый Массив;
	//МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес,Представление", "marina0391@mail.ru",  "marina0391@mail.ru"));
	////--
	
	//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
	//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
	
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
	
	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
			И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
	//-- смарт:ММ 03.03.2021

		ТемаПисьма = "Статус контактных лиц контрагента";
		ТекстИНН = "";
		Если ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			ТекстИНН = ИНН;
		Иначе
			ТекстИНН = ИНН + "/" + КПП;
		КонецЕсли;
	
		ТекстПисьма = "По контрагенту " + Наименование + " " + ТекстИНН 
		+ " изменен статус контактных лиц на значение """ + Строка(смартСтатусКонтактныхДанныхКонтрагента) + """." + Символы.ПС
		+ "Проверьте правильность заполнения контактов и при необходимости актуализируйте их."; 
		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
		
		//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
		//ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		//-- смарт:ММ 03.03.2021
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
			//++ смарт:ММ #098 464 03.03.2021 Доработка рассылок на тестовые адреса
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отправлено уведомление о смене статуса контактных лиц контарагента на адреса: " + МассивАдресовСтрокой);
			Если ПараметрыПисьма.ТестоваяБаза Тогда
				ТекстСообщения = "Отправлено уведомление о смене статуса контактных лиц контарагента НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  МассивАдресовСтрокой + ")";	
			Иначе				
				ТекстСообщения = "Отправлено уведомление о смене статуса контактных лиц контарагента на адреса: " + МассивАдресовСтрокой;				
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//-- смарт:ММ 03.03.2021
		Исключение 
			//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
			смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,Ссылка,ТекстПисьма);
			//-- #1416 смарт: Фролов 30.08.2023
			ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось отправить уведомление о смене статуса контактных лиц контрагента " + Ссылка + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 04.08.2020
		
//++ смарт:ММ #060 319 04.08.2020 - доработка спр. Конрагенты
Функция смартПолучитьАдресаПолучателейУведомлений(МассивАдресовСтрокой = "")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартнерыСпр.смартОсновнойМенеджерСервисЦентра КАК Пользователь
	|ПОМЕСТИТЬ ВТ_СписокПользователей
	|ИЗ
	|	Справочник.Партнеры КАК ПартнерыСпр
	|ГДЕ
	|	ПартнерыСпр.Ссылка = &Партнер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПартнерыСпр.ОсновнойМенеджер
	|ИЗ
	|	Справочник.Партнеры КАК ПартнерыСпр
	|ГДЕ
	|	ПартнерыСпр.Ссылка = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиСпр.смартРабочаяПочта КАК смартРабочаяПочта
	|ИЗ
	|	ВТ_СписокПользователей КАК ВТ_СписокПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиСпр
	|		ПО ВТ_СписокПользователей.Пользователь = ПользователиСпр.Ссылка
	|ГДЕ 
	|	ЕСТЬNULL(ПользователиСпр.смартРабочаяПочта, """") <> """"";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.смартРабочаяПочта);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресовСтрокой = МассивАдресовСтрокой + ?(ЗначениеЗаполнено(МассивАдресовСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции //-- смарт:ММ 04.08.2020

//++ смарт:ММ #081 396 08.11.2020 - Проверка при записи спр. Контрагенты
Процедура смартПроверитьИННЮрЛица(Отказ)
	
	// Проверка на наличие контрагентов с таким ИНН
	
	ПеречислениеЮрЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
	
	Если ЮрФизЛицо = ПеречислениеЮрЛицо 
		И ОбособленноеПодразделение = Ложь 
		И ЗначениеЗаполнено(ИНН) Тогда
		
		// Поиск в спровочнике элемента по трем реквизитам
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЮрФизЛицо = &ЮрФизЛицо
		|	И НЕ Контрагенты.ОбособленноеПодразделение
		|	И Контрагенты.ИНН = &ИНН
		|	И Контрагенты.Ссылка <> &Ссылка
		|	И НЕ Контрагенты.смартНеОбновлятьКППВноситБухгалтерия";
		
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("ЮрФизЛицо", ПеречислениеЮрЛицо);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В базе уже есть юр. лицо с таким ИНН. Возможно, вы пытаетесь задвоить контрагента. Пожалуйста, воспользуйтесь поиском.");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 08.11.2020

#КонецОбласти
